# 데이터프레임 생성

In [ ]:
import numpy as np
import pandas as pd

print(np.__version__)
print(pd.__version__)

2.1.1
2.2.3

- 첫번째 방법 : 리스트 활용
- 두번째 방법 : 딕셔너리 활용(강사 선호)

In [ ]:
data = [
    ["039900", "알파코", 1000000, 10.05],
    ["039910", "A", 500000, 1.05],
    ["039920", "B", 1000, 1.28]
]

columns = ['종목코드', '종목명', '현재가', '등락률']
df = pd.DataFrame(data = data, columns = columns)
df

     종목코드  종목명      현재가    등락률
0  039900  알파코  1000000  10.05
1  039910    A   500000   1.05
2  039920    B     1000   1.28

In [ ]:
data2 = {
    "종목코드" : ['039900', '0399910', '039920'],
    '종목명' : ['알파코', 'A', 'B']
}

df2 = pd.DataFrame(data = data2)
df2

      종목코드  종목명
0   039900  알파코
1  0399910    A
2   039920    B

In [ ]:
import numpy as np
import random
import string

# 랜덤한 회사 이름 생성 함수 (2~10자의 알파벳으로 구성)
def random_company_name():
    length = random.randint(1, 10)  # 회사 이름의 길이 (1~10자)
    return ''.join(random.choices(string.ascii_uppercase, k=length))

# 10,000개의 가상 데이터 생성
data = []
for _ in range(10000):
    stock_code = ''.join(random.choices(string.digits, k=6))  # 6자리 숫자로 주식 코드 생성
    company_name = random_company_name()  # 회사 이름 생성
    price = random.randint(1000, 1000000)  # 주가 (1000 ~ 1000000)
    price_change = round(random.uniform(0, 30), 2)  # 주가 상승률 (0 ~ 30, 소수점 둘째 자리까지)
    data.append([stock_code, company_name, price, price_change])

# 생성된 데이터 확인
for i in range(5):  # 처음 5개 항목 출력
    print(data[i])

['973367', 'INUWLIF', 462799, 29.67]
['697303', 'MZG', 846324, 25.86]
['043197', 'ZUZ', 999671, 24.72]
['038356', 'EMBYBI', 452602, 29.27]
['717868', 'WY', 632994, 16.35]

In [ ]:
import pandas as pd
import random
import string


# Regenerating the dictionary where each key (종목코드, 종목명, 현재가, 등락률) has a list of values

data_dict = {
    "종목코드": [],
    "종목명": [],
    "현재가": [],
    "등락률": []
}

# Function to generate simpler 종목코드 and 종목명 ensuring the 종목코드 starts with '0'
def generate_code_name_for_dict(existing_codes):
    while True:
        code = '0' + ''.join(random.choices(string.digits, k=5))  # Ensure it starts with '0'
        name = ''.join(random.choices(string.ascii_uppercase, k=2))  # Simpler 종목명 with 2 letters
        if code not in existing_codes:
            return code, name

# Generating 10,000 rows of data
existing_codes_for_dict = set()

for _ in range(10000):
    code, name = generate_code_name_for_dict(existing_codes_for_dict)
    existing_codes_for_dict.add(code)
    current_price = random.randint(1000, 1000000)  # Simpler current price
    change_rate = round(random.uniform(-5, 5), 2)  # Simpler change rate

    data_dict["종목코드"].append(code)
    data_dict["종목명"].append(name)
    data_dict["현재가"].append(current_price)
    data_dict["등락률"].append(change_rate)

# Previewing a portion of the dictionary
data_dict_preview = {k: data_dict[k][:5] for k in data_dict}

# data_dict_previw 로 기재하면 5개 조회
df2 = pd.DataFrame(data_dict_preview)
df2

     종목코드 종목명     현재가   등락률
0  003163  NH  777189  4.37
1  000159  UQ  542422 -1.01
2  088000  SW  943870 -3.40
3  079992  OV  490573 -1.62
4  085754  NS  202237 -1.34

In [ ]:
# 데이터 상단부터 (n)개 조회
df2.head(2)

     종목코드 종목명     현재가   등락률
0  003163  NH  777189  4.37
1  000159  UQ  542422 -1.01

In [ ]:
# 데이터 하단부터 (n)개 조회
df2.tail(1)

     종목코드 종목명     현재가   등락률
4  085754  NS  202237 -1.34

In [ ]:
# 데이터 정보
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종목코드    5 non-null      object
 1   종목명     5 non-null      object
 2   현재가     5 non-null      int64
 3   등락률     5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [ ]:
# 여러 수치들
df.describe()

                  현재가        등락률
count        3.000000   3.000000
mean    500333.333333   4.126667
std     499500.083417   5.131046
min       1000.000000   1.050000
25%     250500.000000   1.165000
50%     500000.000000   1.280000
75%     750000.000000   5.665000
max    1000000.000000  10.050000

In [ ]:
data2 = {
    "종목코드" : ['039900', '039910', '039920'],
    "종목명" : ["알파코", "A", "B"],
    "현재가" : [10000000, 500000, 1000],
    "등락률" : [10.05, 1.05, 1.28]
}

df2 = pd.DataFrame(data = data2)
df2

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039920    B      1000   1.28

In [ ]:
# 종목코드를 인덱스로 변경

df2 = df2.set_index("종목코드")
df2

        종목명       현재가    등락률
종목코드
039900  알파코  10000000  10.05
039910    A    500000   1.05
039920    B      1000   1.28

In [ ]:
df2.reset_index()

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039920    B      1000   1.28

In [ ]:
df2.reset_index(drop=True) #df2.reset_index()

   종목명       현재가    등락률
0  알파코  10000000  10.05
1    A    500000   1.05
2    B      1000   1.28

In [ ]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05],
    ["A", 500000, 1.05],
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"] # 인덱스 설정
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [ ]:
df.index.shape

(3,)

In [ ]:
df.index

Index(['039900', '039910', '039900'], dtype='object')

In [ ]:
df.values

array([['알파코', 10000000, 10.05],
       ['A', 500000, 1.05],
       ['B', 1000, 1.28]], dtype=object)

In [ ]:
# 컬럼 조회 방법 2
df.현재가

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [ ]:
# 컬럼 조회 방법 2
df['현재가']

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [ ]:
# 위 방법과 클래스가 다르다 = 속성과 메서드가 다르다
df[['현재가']]

             현재가
039900  10000000
039910    500000
039900      1000

In [4]:
import seaborn as sns
sns.__version__

'0.13.2'

In [5]:
iris = sns.load_dataset("iris")
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [6]:
iris.loc[[0,1], : ]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [7]:
iris.loc[[0, 9], ["sepal_width", "species"]]

   sepal_width species
0          3.5  setosa
9          3.1  setosa

In [8]:
iris.iloc[[0,9],[1,4]]

   sepal_width species
0          3.5  setosa
9          3.1  setosa

In [9]:
# 코드가 일종의 조건식
# 값을 가져오고 싶다면, True 값만 가져옴
# iris['sepal_width'] > 3.5
result = iris.loc[iris['sepal_width'] >= 4.0, :].reset_index(drop=True) # 인덱스 번호 재부여

In [10]:
result

   sepal_length  sepal_width  petal_length  petal_width species
0           5.8          4.0           1.2          0.2  setosa
1           5.7          4.4           1.5          0.4  setosa
2           5.2          4.1           1.5          0.1  setosa
3           5.5          4.2           1.4          0.2  setosa

In [11]:
result2 = iris.loc[iris['sepal_width'] >= 4.0, ['species']].reset_index(drop=True)

In [12]:
result2

  species
0  setosa
1  setosa
2  setosa
3  setosa

In [13]:
# prompt: Result2 의 벨류 값을 list로 가져오기

result2_list = result2['species'].tolist()
print(result2_list)

['setosa', 'setosa', 'setosa', 'setosa']

In [14]:
result_list = result['sepal_length'].tolist()
print(result_list)

[5.8, 5.7, 5.2, 5.5]

In [15]:
# 문자열 기반으로 조회
result = iris.loc[iris['species'] == 'setosa', :].reset_index(drop=True).head(1)
# head 옵션 해서 값이 잘 나오는지 확인 후 재조회

In [16]:
result

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [17]:
# 다중 조건
# iris.loc[:, :] 행 열 조회 테스트
# & : And 연산자
# | : or 연산자
iris.loc[(iris['species'] == 'setosa') &
         (iris['sepal_width']>= 3.0) , :]

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.2  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.6           1.4          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa
40           5.0          3.5           1.3          0.3  setosa
42           4.4          3.2           1.3          0.2  setosa
43           5.0          3.5           1.6          0.6  setosa
44           5.1          3.8           1.9          0.4  setosa
45           4.8          3.0           1.4          0.3  setosa
46           5.1          3.8           1.6          0.2  setosa
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

In [18]:
iris.loc[(iris['species'] == 'virginica') &
         (iris['sepal_width']>= 3.2) , :]

     sepal_length  sepal_width  petal_length  petal_width    species
100           6.3          3.3           6.0          2.5  virginica
109           7.2          3.6           6.1          2.5  virginica
110           6.5          3.2           5.1          2.0  virginica
115           6.4          3.2           5.3          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
120           6.9          3.2           5.7          2.3  virginica
124           6.7          3.3           5.7          2.1  virginica
125           7.2          3.2           6.0          1.8  virginica
131           7.9          3.8           6.4          2.0  virginica
136           6.3          3.4           5.6          2.4  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
148           6.2          3.4           5.4          2.3  virginica

In [19]:
iris.loc[(iris['species'] == 'virginica') &
         (iris['sepal_width']>= 3.2) |
         (iris['petal_length']>= 6.2) , :].reset_index(drop=True)

    sepal_length  sepal_width  petal_length  petal_width    species
0            6.3          3.3           6.0          2.5  virginica
1            7.6          3.0           6.6          2.1  virginica
2            7.3          2.9           6.3          1.8  virginica
3            7.2          3.6           6.1          2.5  virginica
4            6.5          3.2           5.1          2.0  virginica
5            6.4          3.2           5.3          2.3  virginica
6            7.7          3.8           6.7          2.2  virginica
7            7.7          2.6           6.9          2.3  virginica
8            6.9          3.2           5.7          2.3  virginica
9            7.7          2.8           6.7          2.0  virginica
10           6.7          3.3           5.7          2.1  virginica
11           7.2          3.2           6.0          1.8  virginica
12           7.9          3.8           6.4          2.0  virginica
13           6.3          3.4           5.6          2.4  virginica
14           6.8          3.2           5.9          2.3  virginica
15           6.7          3.3           5.7          2.5  virginica
16           6.2          3.4           5.4          2.3  virginica

## 컬럼 추가하기

In [20]:
iris2 = iris.copy() # 복사본 만들어놓기 백업
iris2['newCol1'] = 20 # 새로운 컬럼 추가
iris2['sepals'] = iris2['sepal_length'] ** iris2['sepal_width'] # 새로운 컬럼 추가 + 연산
iris2.head(1)

,sepal_length,sepal_width,petal_length,petal_width,species,newCol1,sepals
0,5.1,3.5,1.4,0.2,setosa,20,299.568135

In [21]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05],
    ["A", 500000, 1.05],
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"] # 인덱스 설정
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [22]:
# axis = 0, 행을 처리한다
# axis = 1, 열을 처리한다
df.drop('039900', axis=0)

       종목명     현재가   등락률
039910   A  500000  1.05

In [23]:
df2 = df.drop('종목명', axis=1)
df2

             현재가    등락률
039900  10000000  10.05
039910    500000   1.05
039900      1000   1.28

In [24]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05],
    ["A", 500000, 1.05],
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"] # 인덱스 설정
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [25]:
df = df.drop('현재가', axis=1) # 이미 삭제된 걸 처리할 땐 attribute error 남
df

        종목명    등락률
039900  알파코  10.05
039910    A   1.05
039900    B   1.28

In [26]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05],
    ["A", 500000, 1.05],
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"] # 인덱스 설정
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)

df2 = df.rename(columns = {'종목명' : 'code',
                           '현재가' : 'current',
                           '등락률' : 'updown'}) # 기존컬럼 : 새로운 컬럼
df2

       code   current  updown
039900  알파코  10000000   10.05
039910    A    500000    1.05
039900    B      1000    1.28

In [27]:
data = [
    ["1,000", "1,100", '1,510'],
    ["1,410", "1,420", '1,790'],
    ["850", "900", '1,185'],
]
columns = ["03/02", "03/03", "03/04"]
df = DataFrame(data=data, columns=columns)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   03/02   3 non-null      object
 1   03/03   3 non-null      object
 2   03/04   3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [28]:
# prompt: map함수로 int 형식으로 타입 바꾸고 싶어

# 람다 함수를 사용하여 ','를 제거하고 int로 변환
df = df.applymap(lambda x: int(x.replace(',', '')) if isinstance(x, str) else x)
df

/var/folders/4t/lxzd9js10cb1w262tdv6bk740000gn/T/ipykernel_9585/1564219191.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x: int(x.replace(',', '')) if isinstance(x, str) else x)

   03/02  03/03  03/04
0   1000   1100   1510
1   1410   1420   1790
2    850    900   1185

In [29]:
# prompt: map 함수를 정의해서 사용하는 방법으로 알려줘.

def remove_comma_and_convert_to_int(value):
  if isinstance(value, str):
    return int(value.replace(',', ''))
  return value

df = df.applymap(remove_comma_and_convert_to_int)
df

/var/folders/4t/lxzd9js10cb1w262tdv6bk740000gn/T/ipykernel_9585/3268174979.py:8: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(remove_comma_and_convert_to_int)

   03/02  03/03  03/04
0   1000   1100   1510
1   1410   1420   1790
2    850    900   1185

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   03/02   3 non-null      int64
 1   03/03   3 non-null      int64
 2   03/04   3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

## 데이터 내보내기

In [31]:
import pandas as pd

iris.to_csv('iris_240930.csv', index=False)
iris.to_excel('iris_excel_240930.xlsx')
# 구글 코랩은 왼쪽 파일에서 확인가능

## 데이터 불러오기

In [32]:
df = pd.read_csv('iris_240930.csv')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [36]:
excel_df = pd.read_excel('test/iris_excel_240930.xlsx') # 하위폴더명 추가
excel_df

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species
0,0,5.1,3.5,1.4,0.2,setosa
1,1,4.9,3.0,1.4,0.2,setosa
2,2,4.7,3.2,1.3,0.2,setosa
3,3,4.6,3.1,1.5,0.2,setosa
4,4,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
145,145,6.7,3.0,5.2,2.3,virginica
146,146,6.3,2.5,5.0,1.9,virginica
147,147,6.5,3.0,5.2,2.0,virginica
148,148,6.2,3.4,5.4,2.3,virginica
149,149,5.9,3.0,5.1,1.8,virginica